#print("Перевірка")
#Запис camel case - пишемо одне слова, але щоб
#краще читати робимо великі букви для нових слів
firstName = "Іван"
firstname = 'Іван'
# це 2 різних мізних вони відрізняються регістром
print("Привіт", firstName)

a = 12 # Цілі числа - a - зберігає у собі цілі числа
print("a =", a)

b = 34.45 # Дробове число - потрібно писати через . дробова частина
print("b = ", b)

isMan=True # Зберігає булівське значення True або False
isMan=False # Зберігає хибне значення
print("isMan =", isMan)

text = "Класна погода"
print("text =", text)

#Можна використовувати спеціальні символи \t, \n, 
#\t - відступ табуляції
#\n - перехід на новий рядок
text = "Можна іти гуляти\nВийшло соничко на вулицю\n\tБіжу по калюжах"
print("text =", text)

email = 'petro@gmail.com'
name = "Мурчик Максим"
string = f'name = {name}\temail = {email}' #перед рядком f - означає, що буде підстановка
print(string)

#Динамічна типізація - це коли тип даних може змінювати у процесі виконання
age = 18
print("type(age) =", type(age))
age = "Сало"
print("age =", age)
print("type(age) = ", type(age)) # type - перевіряє який тип зберігаєть в age

print("Даний текст виводиться у рядок і після нього новий рядок", end=" ")
print("Новий рядок")