# Імпортуємо клас Workbook з бібліотеки openpyxl 
from openpyxl import Workbook  

print("---- Starting main.py ---")
# Створюємо нову книгу Excel
# Це спеціальний об'єкт, для роботи з Excel файлами, який дозволяє створювати, редагувати та зберігати файли у форматі .xlsx
wb = Workbook()
# Перша книга Excel за замовчуванням містить один лист, який називається "Sheet". Ми отримуємо цей лист, щоб мати можливість працювати з ним.
ws = wb.active  # Отримуємо активний лист (перший лист) з книги
# Записуємо дані в клітинки A1, B1 та C1
ws['A1'] = 42  # Записуємо число 42 в клітинку A1
wb.save("example.xlsx")  # Зберігаємо книгу Excel з ім'ям "example.xlsx"
print("---- Finished main.py ---")