# print("Привіт козаки і козачки :)")
fileName = "my.txt"
# відкриваємо файл  my.txt
try:  # У блок try поміщається блок коду, який може відвалитися (статися помилка)
    my = open(fileName, "r", encoding="utf-8") #спроба відкрити файл
    fileContent = my.read() # читаємо усі дані із файлу
    print(f"++Вміст файлу {fileName}++")
    print(fileContent)
    my.close() # стараємося завжди закривати файл.
except: # Якщо щось трапляється в блоці try код пеходить у даний блок
    print("--Помилка роботи із файлом--")

print("Завершення програми :)") #Виводимо інфомрацію про звершення роботи програми