#Запис даних у файл
# print("Привіт козаки і козачки :)")
# Якщо відриваємо файл для запису - флажок w - то файл
# автоматично створюється, якщо його немає.
fileOutput = open("users.txt", 'w', encoding='utf-8') # файл відкритий для запису
#змінна fileOutput - зберігання посилання на файл users.txt
#fileOutput - підключений до файлу і зберігає вказіник
# на позицію у файлі - на початку позиція у файлі 0 - початок файлу
fileOutput.write("Добре їсти\n") #запусуємо рядок
#позиція у файлу змітилася до \n
fileOutput.write("Добре спати\n") #записуємо рядок
fileOutput.write("Має Бог здоров'я дати\n") #записуємо рядок
fileOutput.close()#відключаюся від файлу