# Діапазо значень
start = int(input("Введіть початок діапазону: "))
end = int(input("Введіть кінець діапазону: "))
print(f"Числа від {start} до {end}:")
parni = [] # буде зберігати парні числа масиву - список пустий
i = start # лічильник циклу
print("Увесь діапазон:")
while i <= end:
    print(i, end=' ')
    if i % 2 == 0:
        parni.append(i) # додаємо парне число до списку парних чисел 
    i += 1 # крок ітерації діапазону
print() # для переходу на новий рядок після виведення діапазону

print("Парні числа в діапазоні:")
for item in parni:
    print(item, end='\t')