a = 0 # сюди користувач вводить 1 число
b = 0 # сюди користувач вводить 2 число

#print("Вкажіть значення a: ")
#Змінюємо тип з int на текст
a=input("Вкажіть значення a: ") # Це є текст
b=input("Введіть значення b: ") # Це є текст - звичайні символи
#int() - це фунція, яке перетворює вхідне значення у число
#str() - функція, яка із вхідного значення робить рядок
c = int(a) + int(b) 
# print("a + b = " + str(c))
print(a + " + " + b + " = " + str(c))
c = int(a) - int(b) # Віднімаємо значення двох змінних
print(a + " - " + b + " = " + str(c))
c = int(a) * int(b) # множення значення двох змінних
print(a + " * " + b + " = ", c) # через , виводиться значення змінної