#print("Привіт! Сьогодні класна погода :)")
#Будемо виводити результат арифметичної операції
#print(3+4) # Реєгістр символів має значення
#  print("Не вірний код")
#PRINT("Привіт! - це не вірно")
# Print("Привіт - це не вірно")

# -- однорядковий коментар - коментує 1 рядок
'''
Привіт класна погода
Це є багато рядковий коментар
'''

# print("Мене звати: ", "Вова", "IT STEP") 
print("Як Вас звати:")
#змінна має певне назву і може зберігати значення
name = input() #змінна - це величка, яка може зберігати інформацію
print("Приємно познайомитися: ", name)
