#Виводимо повідомлення на екран
print("Привіт команда!")
# генерація послідовності чисел
items = range(5) # створили змінну items, яка зберігає послідовність
# items - зберігає числа від 0 до 4
lengthItems = len(items) # lengthItems - зберігає довжину послідновності
print("lengthItems = ", lengthItems) # виводимо довжину послідовності

# Цикл for для ітерації по послідовності
# Синтакси for: 
# for нова_змінна in назва_послідновості:
#   блок_коду_для_виконання
# Цикл працює ітераціями - тобто тіло циклу (код у середину циклу)
# код, який працює у середині циклу буде мати відступ (4 пробіли або табуляція)
for salo in items: # перебирає елементи послідовності, що знаходяться в items
    print("item = ", salo) # виводимо поточне значення змінної salo)

print("Вкажіть діапазон чисел:")
begin = int(input()) # вводимо числа з клавіатури
end = int(input()) # вводимо числа з клавіатури

print(f"begin = {begin}, end = {end}")

# генеруємо вказану послідовність чисел
myrange = range(begin, end) # створили послідовність чисел від begin до end
print("Ваша послідовність чисел:")
for myitem in myrange: # цикл for перебирає послідовність myrange
    print(myitem, end="\t") # виводимо всі числа в одному рядку через табуляція
