print("----Використання циклу for-----")

ints = (23, 17, 5, 12, 8, 9, 16) # набір цілих чисел
# ints = [23, 17, 5, 12, 8, 9, 16] # набір цілих чисел
# f - форматований рядок - це рядок у який можна підставляти змінну через {}
for item in ints:
    print(f"item = {item}") # виводимо всі числа з набору ints
    # print("item = ", item)
# як перевірити парність числа - %
print("Пошук парних числе у послідовності:")
for item in ints:
    if(item % 2 == 0):
        print(item, end="\t") # виводимо парні числа в одному рядку через табуляція
#myint = 11
#if(myint % 2 == 0): # 11 / 2 = 5, остача 1, 18 % 2 = 0 -- 9
#    print(f"{myint} - парне число")
#else:
#    print(f"{myint} - непарне число")



