#Виводимо текст на екран
print("Вкажіть вік козаків:")
# Запитуємо вік
age = int(input()) # int() - переводимо текст у число, input() - зчитуємо текст з консолі
count = 0 # лічильник козаків
people = 0 # кількість людей вік, яких від 18 до 60 років
# and - логічне "і" - обидві умови мають бути істинними
while age > 0: # поки вік більший 0
    # if age >= 18 and age < 60:
    if 18 <= age < 60:
        people += 1
    age = int(input("Вкажіть вік наступного козака (0 - вихід):"))
    count += 1 # збілльшуємо кількість на 1 козак

print("Ви вказали наступну кількість козаків:", count)
print("Кількість призовників: ", people)
