print("Оператор break та continue")
#break - перериває роботу циклу
#continue - повертає цикл до перевірки умови, тобто робить повтор
#школа - підрахувати скільки учнів є в школі
#вік учнів
ages = (12, 18, 23, 123, 61, 10)
count = 0
index = 0 # індекс для доступу до елементів послідовності
count_ages = len(ages) # довжина послідовності
while index < count_ages: # цикл завершиться коли буде кінець послідовності
    age = ages[index] # отримую елемент по індексу
    if age > 100:
        print("Програма стикнулася із критичною помилкою! Робота не можлива")
        break
    if age < 18:
        count+=1
    else:
        index += 1
        continue # якщо це не дити школи - print - буде виводитися, якщо if працює
    print(f"Дитині зараз {age} до повноліття лишилося ", 18-age)
    index += 1
    
print("Кількість діте школи ", count)