print("----Арифметичні операції----")
# +, -, *, /, //, **, %, +=, -=, *=, /=, //=, **=, %=
# Додавання рядків - конкатонація 
a = input("Вкажіть значення a = ") # input - повертає рядок
b = input("Вкажіть значення b = ") # input - повертає рядок

print(f"a = {a}\tb = {b}") # Щоб перевірити, що у нас у змінних a та b
#int() функція яка перетворює значення рядка у число
intA = int(a) # перетворили рядок a до цілого числа intA
intB = int(b) # float - перетворити в дробове значення
c = intA + intB
print(f"a + b = {c}") # f - рядок підстановки - буде підставляти змінна {}

c = intA - intB
print(f"a - b = {c}") 