#Використання конструкції elif для перевірки кількох умов
# lower() - приводить усі введні символи користувача у нижній регістр
# asdlfjaslfj - нижній регістр - усі сиволи у малій формі
# ASDFLJALSFJL - верхній регістр - усі символи у великій формі
language = input("Введіть вашу улюблену мову програмування: ").lower()
print("Ваша мова програмування: " + language)
if language == 'python':
    print("Ви обрали Python!")
    print("Python - це чудовий вибір для початківців.")
    print("Для складних та маштабних проєктів можна щось краще.")
elif language == 'java':
    print("Ви обрали Java!")
    print("Java використовується для розробки мобільних додатків " \
        "та корпоративних систем.")
elif language == 'c++':
    print("Ви обрали C++!")
    print("C++ підходить для розробки ігор та системного програмування.")
else:
    print("Ви вказали не зрозумілу нам мову - " + language + ".")