# Оператор умови (тернарний оператор) у Python
#print("Привіт!")
#if Умова:     -- Пишемо будь-яку умову після умови ствимо :
    # Виконується, якщо умова істинна
 #   виконайте_дію_1()

age = input("Введіть ваш вік: ") # Ми з клавіуатури вводимо текстове значення
#перетворив текстове значення у ціле число - бо ми маємо вік у вигляді числа
age = int(age)  # Перетворюємо текстове значення у ціле
if age >=18:
    print("Ми Вас вітаємо. Ви повнолітній(я)!")
    print("Ви можете здавати на водійські права.")
else:
    print("Вибачте, але Ви ще надто молоді.")
    print("Ви не можете здавати на водійські права.")
#Цей код виконується завжди, тобо на нього не впливає умова if або else
print("Дякуємо за увагу!")