print("----Умовні вирази в Python---")
# == Оператор рівності
# != Оператор нерівності
# > Оператор більше
# < Оператор менше
# >= Оператор більше або дорівнює
# <= Оператор менше або дорівнює

c = 2 == 4 # c - булеве значення (True або False)
print("2==4 =",c)  # False

a = 8
b = 5
c = a = b # = - оператор присвоєння - Надання значення змінній
print("с = a = b =", c)  # 5
a = 14 # Присвоєння значення 14 змінній a
c = a != b # Оператор нерівності !=
print("a != b =", c)  # True
# a = 14 b = 5
c = a >= b # Оператор більше або дорівнює >=
print("a >= b =", c)  # True