print("---Перевірка вмінь додавати та віднімати числа--")
result = input("Скільки буде 2 + 2? ") #Вводимо символи з клавітури (тобто рядок)
a = 2
b = 2
c = a + b #виділяємо память під змінну c і записуємо туди результат додавання a і b
print("type of result:", type(result)) #перевіряємо тип змінної result
print("type of c:", type(c))
if result == str(c): # перетворюємо змінну c у рядок(набір симоволів)
    print("Правильно!")
else:
    # print("Неправильно! 2 + 2 =", str(c))
    print("Неправильно! 2 + 2 = "+ str(c)) #конкатенація рядків (складання рядків)

#c = "Ковбаса" # перезаписуємо змінну c рядком "Ковбаса" тобто зміни тип даних з int на str