# while - цикл з передумовою
# для роботи циклу умова має бути вірною (True)
i = 0  # початкове значення лічильника
count = input("Скажіть кількість кроків циклу: ")
# ствоюємо цикл, який буде працювати доки i < 5
while i < int(count):  # умова виконання циклу
    print("Поточне значення i:", i)  # виведення поточного значення лічильника
    i += 1  #i=i+1 змінуює ітерації циклу - збільшення лічильника на 1
print("Цикл завершено. Остаточне значення i:", i)  # виведення остаточного значення лічильника