# Оголосив функцію і назва її myPrint
def myPrint(): # Дана фукнція не приймає параметрів
    print("Це моя функція")

# виликав або використав дану функцію
myPrint()

#Параметри - це вхідні дані для функції
#Особливості використання функції:
# 1.Фукнції можуть приймати параметри або бути без параметрів
# В залежності від задачі, яка ставиться на функцію, можне
# не приймати параметрів взагалі або приймати 1 параметри, 
# 2 - параметри або певний масив(набір) параметрів

# Для побудови функції з параметрами, потрібно вкзати
# назви вхідного парамтра. 
# 
# Давайте зробимо функцію, яка приймає 1 параметр - змінну.
# і вводить значення параметра на екран

# змінна text - це формальний параметр, фукнції, який може 
# використовуватися у середині функції
# формальний, бо коли буде визивати функція, 
# то він буде фактино - якимося певним текстом.

def myHelloFriend(text): # функція називається myHelloFriend
    print("---"+text+"---") # + - конкатонація рядків - об'єднання (зклеювання)

# в даному випадку text = "Салют команда"
myHelloFriend("Салюк команда :)") # слово "Салюк команда"

name = input("Як Вас звати: ->_") # створили змінну name - записали у неї текст з клавітарури 
myHelloFriend(name) # Фукнція приймає фактиний параметр name - що вводимо з консолі



