# Будемо робити фукнції, які виконують певну трішки більшу роботу
# Фукнція буде запитувати name користувача і виводити привітання.
# При цьому функція не буде приймати параметрів. Усе буде в середині

def myInputUserName(): #myInputUserName - назва функції
    userName = input("Вкажіть Ваше ім'я: ->_") #ввід даних
    print("--Вітаємо у нашій програмі--") 
    print("Ви отримали знижку 5% за реєтсацію у додатку")
    print("Гарного настрою ", userName, " :)")

# Для виклику функції - потрібно 1 рядок
myInputUserName()