# Функція приймає 2 паметри 
# 1 - параметр - кількість разів
# 2 - параметр - текст, який виводимо
# Коли виводимо на екран формат воводу має бути такий
# 1 - ТЕКСТ
# 2 - ТЕКСТ
# n - ТЕКСТ
# Якщо 1 парамет менший 0, то нічого не робимо


def myViewSalo(countTry, myText):
    #countTry = 3 # кількість спроб
    #myText = "Сало"
    i=0 # лічильник циклу
    while i<countTry:
        print(f"{i+1} - {myText}") # f"" рядок у який підставляють змінн {}
        i+=1

count = input("Вкажіть кількість ->_")
text = input("Вкажіть повідомлення ->_")
# myViewSalo(2,"Слава Україні")
myViewSalo(int(count), text)